**** Application to the O I lines

Compare O I lines with Ly \beta (average of doublet)
| Line                                  |     Wav, \AA | Freq, cm^-1 |   d freq |
|---------------------------------------+------------+------------+----------|
| H I Ly \beta  1s 2S_{1/2 }\to 3p 2P_{1/2,3/2}     | 1025.72220 |  97492.283 |    0.000 |
|---------------------------------------+------------+------------+----------|
| O I 2s^2 2p^4 3P_0 \to 2s^2 2p^3 (4S) 3d 3D_1 | 1028.15729 |  97261.383 | -230.900 |
|---------------------------------------+------------+------------+----------|
| O I 2s^2 2p^4 3P_1 \to 2s^2 2p^3 (4S) 3d 3D_1 | 1027.43139 |  97330.100 | -162.183 |
| O I 2s^2 2p^4 3P_1 \to 2s^2 2p^3 (4S) 3d 3D_2 | 1027.43077 |  97330.159 | -162.124 |
|---------------------------------------+------------+------------+----------|
| O I 2s^2 2p^4 3P_2 \to 2s^2 2p^3 (4S) 3d 3D_1 | 1025.76339 |  97488.369 |   -3.914 |
| O I 2s^2 2p^4 3P_2 \to 2s^2 2p^3 (4S) 3d 3D_2 | 1025.76276 |  97488.429 |   -3.854 |
| O I 2s^2 2p^4 3P_2 \to 2s^2 2p^3 (4S) 3d 3D_3 | 1025.76170 |  97488.530 |   -3.753 |
|---------------------------------------+------------+------------+----------|
#+TBLFM: $4=$3 - @2$3;f3::



Average frequency and wavenumber of H\alpha (2s \to 3p)
|                            |   |               | freq, cm^-1 | check freq |
|----------------------------+---+---------------+------------+------------|
| H I H\alpha 2s 2S_{1/2 }\to 3p 2P_{1/2} | 2 | 6564.58439369 |   15233.26 |   15233.26 |
| H I H\alpha 2s 2S_{1/2 }\to 3p 2P_{3/2} | 4 | 6564.53767551 |   15233.37 |   15233.37 |
|----------------------------+---+---------------+------------+------------|
| H I H\alpha 2s \to 3p             | 6 |   6564.553248 |   15233.33 |   15233.33 |
#+TBLFM: $5=1e8/$3 ; f2::@4$3=(2 @2  + 4 @3) / 6 ; f6::@4$4=(2 @2  + 4 @3) / 6 ; f2

O I Line transformed to H\alpha domain
|  H\alpha freq |   d freq |  O I freq |   O I wav |
|----------+----------+-----------+-----------|
| 15233.33 | -230.900 |  15002.43 | 6665.5868 |
| 15233.33 | -162.183 | 15071.147 | 6635.1951 |
| 15233.33 | -162.124 | 15071.206 | 6635.1691 |
| 15233.33 |   -3.914 | 15229.416 | 6566.2400 |
| 15233.33 |   -3.854 | 15229.476 | 6566.2141 |
| 15233.33 |   -3.753 | 15229.577 | 6566.1706 |
#+TBLFM: $3=$1 + $2::$4=1e8 / $3

Now convert back to air wavelengths
+ vac/air = 1 + 8.06051e-5 + 2.480990e-2 / (132.274 - (1e4/wav)**2) + 1.74557e-4 / (39.32957 - (1e4/wav)**2)
+ That is from Morton:2003b who cite Peck & Reeder (1972)

| Line           |         vac |         n |       air |
|----------------+-------------+-----------+-----------|
| H\alpha 2s \to 3p     | 6564.553248 | 1.0002762 | 6562.7406 |
| O I 3P_0 \to  3D_1 |   6665.5868 | 1.0002761 | 6663.7469 |
| O I 3P_1 \to  3D_1 |   6635.1951 | 1.0002762 | 6633.3630 |
| O I 3P_1 \to  3D_2 |   6635.1691 | 1.0002762 | 6633.3370 |
| O I 3P_2 \to  3D_1 |   6566.2400 | 1.0002762 | 6564.4269 |
| O I 3P_2 \to  3D_2 |   6566.2141 | 1.0002762 | 6564.4010 |
| O I 3P_2 \to  3D_3 |   6566.1706 | 1.0002762 | 6564.3575 |
#+TBLFM: $3=1 + 8.06051e-5 + (2.480990e-2 / (132.274 - (1e4/$2)**2)) + (1.74557e-4 / (39.32957 - (1e4/$2)**2))::$4=$2/$3


